In [1]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "Students Name":["Ajay Kumar","Chandan Roy","Manohar Suman","Sumit Gupta","Akash Anand"],
    "Students Marks":[60,70,80,90,100],
    "Students Cities":["Darbhanga","Patna","Madhubani","MujhaffarPUr","Chapra"]
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

   Students Name  Students Marks Students Cities
0     Ajay Kumar              60       Darbhanga
1    Chandan Roy              70           Patna
2  Manohar Suman              80       Madhubani
3    Sumit Gupta              90    MujhaffarPUr
4    Akash Anand             100          Chapra

In [11]:
df.to_csv('studentsDetails.csv') # It will convert the data in excel file with index

In [16]:
df.to_csv('datalist.csv', index=False) # It will convert data set in excel sheet without index

In [13]:
df.head(2) # It will show the top 2 rows

  Students Name  Students Marks Students Cities
0    Ajay Kumar              60       Darbhanga
1   Chandan Roy              70           Patna

In [14]:
df.tail(3) # It will show bottom 3 rows

   Students Name  Students Marks Students Cities
2  Manohar Suman              80       Madhubani
3    Sumit Gupta              90    MujhaffarPUr
4    Akash Anand             100          Chapra

In [15]:
df.describe() # It will return the list of numberical analysis

       Students Marks
count        5.000000
mean        80.000000
std         15.811388
min         60.000000
25%         70.000000
50%         80.000000
75%         90.000000
max        100.000000

In [18]:
Data = pd.read_csv('train.csv') # It will read all csv data

In [19]:
Data

   Train No  Speeds       Cities
0     12560      60     Darbhanga
1     12630      70         Patna
2     12740      80     Madhubani
3     13555      90  MujhaffarPUr
4     18590     100        Chapra

In [20]:
Data['Speeds'] # It return all data of Speeds coloum

0     60
1     70
2     80
3     90
4    100
Name: Speeds, dtype: int64

In [21]:
Data['Speeds'][0] # It return data of speeds of index 0th position

60

In [22]:
Data['Speeds'][0] = 199

c:\users\ajay\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [23]:
Data

   Train No  Speeds       Cities
0     12560     199     Darbhanga
1     12630      70         Patna
2     12740      80     Madhubani
3     13555      90  MujhaffarPUr
4     18590     100        Chapra

In [24]:
Data.to_csv('train.csv') # It will update the train csv file

In [26]:
Data.index = ["First","Second","Third","Fourth","Fifth"] # It will update the index

In [27]:
Data

        Train No  Speeds       Cities
First      12560     199     Darbhanga
Second     12630      70         Patna
Third      12740      80     Madhubani
Fourth     13555      90  MujhaffarPUr
Fifth      18590     100        Chapra